package ru.psu.techjava.services

import ru.psu.techjava.model.Order
import ru.psu.techjava.repositories.OrderRepository
import tornadofx.Controller

/********************************************************************************************************
  Сервис с логикой для работы со списком обращений
  Описание: взаимодействует с репозиторием обращений
 *******************************************************************************************************/
class OrderService : Controller()
{
    private val repositoryAppeals : OrderRepository by inject()

    /****************************************************************************************************
      Запрос списка всех доступных объектов на сервере
     ***************************************************************************************************/
    fun getAll() = repositoryAppeals.getAll()

    /****************************************************************************************************
      Отправка всех данных из списка на сервер
     ***************************************************************************************************/
    fun saveAll() = repositoryAppeals.saveAll()

    /****************************************************************************************************
      Отправка данных для добавления объекта на сервер
      Вход: Appeal - объект для отправки
     ***************************************************************************************************/
    fun add(order : Order)
    {
        repositoryAppeals.add(order)
    }

    /****************************************************************************************************
      Отправка данных для удаления объекта на сервер
      Вход: Appeal - объект для отправки
     ***************************************************************************************************/
    fun delete(order : Order) = repositoryAppeals.delete(order)
}