package ru.psu.techjava.services

import ru.psu.techjava.model.Position
import ru.psu.techjava.repositories.PositionRepository
import tornadofx.Controller

/********************************************************************************************************
Сервис с логикой для работы со списком граждан
Описание: взаимодействует с репозиторием граждан
 *******************************************************************************************************/
class PositionService : Controller()
{
    private val repositoryCitizens : PositionRepository by inject()

    /****************************************************************************************************
    Запрос списка всех доступных объектов на сервере
     ***************************************************************************************************/
    fun getAll() = repositoryCitizens.getAll()

    /****************************************************************************************************
    Отправка всех данных из списка на сервер
     ***************************************************************************************************/
    fun saveAll() = repositoryCitizens.saveAll()

    /****************************************************************************************************
    Отправка данных для добавления объекта на сервер
    Вход: Citizen - объект для отправки
     ***************************************************************************************************/
    fun add(position : Position)
    {
        repositoryCitizens.add(position)
    }

    /****************************************************************************************************
    Отправка данных для удаления объекта на сервер
    Вход: Citizen - объект для отправки
     ***************************************************************************************************/
    fun delete(position : Position) = repositoryCitizens.delete(position)
}