package ru.psu.techjava.viewmodels

import ru.psu.techjava.model.Order
import tornadofx.ItemViewModel

/********************************************************************************************************
  Модель представления для одного обращения
  Описание: описывает данные одного объекта и сохраняет их в кэше
 *******************************************************************************************************/
class OrderViewModel(order : Order) : ItemViewModel<Order>(order)
{
    val id = bind(Order::propertyId)
    val date = bind(Order::propertyDate)
    val status = bind(Order::propertyStatus)

    /****************************************************************************************************
      Сохранение данных из полей формы в объект в оперативной памяти
     ***************************************************************************************************/
    fun save()
    {
        //Сохранение данных из полей на форме в сущность
        this.commit()
    }


}