package ru.psu.techjava.viewmodels

import javafx.beans.property.SimpleBooleanProperty
import ru.psu.techjava.model.Position
import ru.psu.techjava.services.PositionService
import tornadofx.Controller

/********************************************************************************************************
  Модель представления для списка организаций
  Описание: позволяет добавить пустую запись в таблицу, удалить запись
  и отправить все текущие записи на сервер
 *******************************************************************************************************/
class PositionListViewModel : Controller()
{
    //Сервис с логикой для работы со списком организаций
    private val positionService : PositionService by inject()

    //Список обращений с возможность отслеживания изменений
    val positions = positionService.getAll()

    //Факт наличия выделения в таблице
    val elementSelected = SimpleBooleanProperty(false)

    /****************************************************************************************************
      Добавление пустой записи в таблицу
     ***************************************************************************************************/
    fun add()
    {
        positionService.add(Position())
    }
    /****************************************************************************************************
      Удаление записи из списка
      Вход: item - элемент для удаления
     ***************************************************************************************************/
    fun delete(item : Position?)
    {
        //Если элемент не указан - ничего не делаем
        item ?: return
        positionService.delete(item)
    }
    /****************************************************************************************************
      Обработка изменения выделенных элементов в списке
      Вход: selectedItem - выделенный элемент
     ***************************************************************************************************/
    fun onSelectionChange(selectedItem : Position?)
    {
        elementSelected.set(selectedItem != null)
    }
    /****************************************************************************************************
      Отправка всех текущих данных из списка на сервер
     ***************************************************************************************************/
    fun saveAll()
    {
        positionService.saveAll()
    }

}