package ru.psu.techjava.viewmodels

import javafx.beans.property.SimpleBooleanProperty
import ru.psu.techjava.model.Provider
import ru.psu.techjava.services.ProviderService
import tornadofx.Controller

/********************************************************************************************************
  Модель представления для списка граждан
  Описание: позволяет добавить пустую запись в таблицу, удалить запись
  и отправить все текущие записи на сервер
 *******************************************************************************************************/
class ProviderListViewModel : Controller()
{
    //Сервис с логикой для работы со списком граждан
    private val providerService : ProviderService by inject()

    //Список обращений с возможность отслеживания изменений
    val providers = providerService.getAll()

    //Факт наличия выделения в таблице
    val elementSelected = SimpleBooleanProperty(false)

    /****************************************************************************************************
    Добавление пустой записи в таблицу
     ***************************************************************************************************/
    fun add()
    {
        providerService.add(Provider())
    }
    /****************************************************************************************************
    Удаление записи из списка
    Вход: item - элемент для удаления
     ***************************************************************************************************/
    fun delete(item : Provider?)
    {
        //Если элемент не указан - ничего не делаем
        item ?: return
        providerService.delete(item)
    }
    /****************************************************************************************************
    Обработка изменения выделенных элементов в списке
    Вход: selectedItem - выделенный элемент
     ***************************************************************************************************/
    fun onSelectionChange(selectedItem : Provider?)
    {
        elementSelected.set(selectedItem != null)
    }
    /****************************************************************************************************
    Отправка всех текущих данных из списка на сервер
     ***************************************************************************************************/
    fun saveAll()
    {
        providerService.saveAll()
    }

}